24-cliente-web-service-soap/app/src/main/java/com/example/profesormanana/a24_cliente_web_service_soap/MainActivity.java

package com.example.profesormanana.a24_cliente_web_service_soap;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.util.Log;

import org.ksoap2.SoapEnvelope;
import org.ksoap2.SoapFault;
import org.ksoap2.serialization.SoapObject;
import org.ksoap2.serialization.SoapSerializationEnvelope;
import org.ksoap2.transport.HttpTransportSE;
import org.xmlpull.v1.XmlPullParserException;

import java.io.IOException;
import java.net.Proxy;

public class MainActivity extends AppCompatActivity {


/*
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
     xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <q0:read xmlns:q0="http://a21_sqlite.profesormanana.example.com">
      <q0:id>1</q0:id>
    </q0:read>
  </soapenv:Body>
</soapenv:Envelope>
 */
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        new KSoapAsyncTask().execute();
    }
}
